{
  "projectName": "ZMDE Civilization Simulations",
  "channel": "@ZMDE",
  "format": "Villager Civilization Simulation",
  "totalCount": 30,
  "lastUpdated": "2026-02-28T16:45:00Z",
  "briefs": [
    {
      "id": 1,
      "title": "I Gave Villagers 100 Days To Survive For 1000 Years",
      "creatureName": "Survival Countdown",
      "creatureIcon": "⚡",
      "category": "pop_culture",
      "hook": "What happens when villagers know they only have 100 days to live — but I keep resetting the clock?",
      "sourceTitle": "I Survived Hardcore Minecraft For 100 Days",
      "sourceChannel": "Forge Labs",
      "sourceUrl": "https://www.youtube.com/watch?v=iYzfeWaenlU",
      "sourceViews": "52,000,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "The Clock Starts",
          "description": "I place a massive doomsday timer in the village center. Every villager can see it. They have 100 days before everything resets. Panic spreads immediately. Some start hoarding, others pray."
        },
        {
          "days": "Year 50",
          "title": "The Cycle Keepers",
          "description": "Villagers discover the timer resets — they don't die, they just lose everything. A faction called the Rememberers starts recording knowledge on unbreakable blocks to carry between cycles."
        },
        {
          "days": "Year 100",
          "title": "The Optimization",
          "description": "After dozens of resets, villagers have perfected a 100-day civilization speedrun. They build cities in 10 days. But a rebel faction wants to break the timer permanently."
        },
        {
          "days": "Year 500",
          "title": "The Time War",
          "description": "Two civilizations emerge: one that embraces the resets as immortality, another that sees them as a prison. They wage war across multiple cycles."
        },
        {
          "days": "Year 999",
          "title": "The Final Cycle",
          "description": "The rebels finally crack the timer code. But destroying it means true death becomes possible. The entire civilization must vote: eternal resets or mortality."
        },
        {
          "days": "Ending",
          "title": "The Choice",
          "description": "They choose mortality. The timer shatters. For the first time in 1000 years, a villager grows old and dies. And they're at peace with it."
        }
      ],
      "challenges": [
        "Villagers discover the timer resets — they don't die, they j",
        "Two civilizations emerge: one that embraces the resets as im",
        "The rebels finally crack the timer code. But destroying it m"
      ],
      "climax": "They choose mortality. The timer shatters. For the first time in 1000 years, a villager grows old and dies. And they're at peace with it."
    },
    {
      "id": 2,
      "title": "Villagers Simulate Desert Island Civilization For 1000 Years",
      "creatureName": "Island Survival",
      "creatureIcon": "⚡",
      "category": "scale_spectacle",
      "hook": "I stranded 10,000 villagers on a tiny island with nothing. 1000 years later, they built an underwater empire.",
      "sourceTitle": "I Survived 100 Days STRANDED on an ISLAND",
      "sourceChannel": "ACookieGod",
      "sourceUrl": "https://www.youtube.com/watch?v=hqfEgHFznoA",
      "sourceViews": "18,500,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "Shipwrecked",
          "description": "10,000 villagers wash up on a barren island barely big enough to stand on. No trees, no animals. Just sand and ocean. Immediate chaos as they fight over the highest ground."
        },
        {
          "days": "Year 50",
          "title": "The Fishers",
          "description": "Villagers adapt to ocean life. They build rafts, discover underwater caves, and develop a pearl-based currency. The island itself has been built up with coral harvesting."
        },
        {
          "days": "Year 100",
          "title": "The Depth Dwellers",
          "description": "A faction moves entirely underwater, building air-pocket cities in ocean monuments. Surface villagers trade food for underwater gems. Two distinct cultures form."
        },
        {
          "days": "Year 500",
          "title": "The Trench",
          "description": "Deep ocean exploration reveals ancient structures. The underwater civilization becomes dominant, building pressure-resistant glass cities. Surface dwellers are now considered primitive."
        },
        {
          "days": "Year 999",
          "title": "The Flood",
          "description": "A massive tsunami threatens to destroy everything. Surface and deep villagers must cooperate for the first time in centuries to build a barrier."
        },
        {
          "days": "Ending",
          "title": "The Discovery",
          "description": "While building the barrier, they find land — a massive continent was just 100 blocks away the entire time. They'd never looked."
        }
      ],
      "challenges": [
        "Villagers adapt to ocean life. They build rafts, discover un",
        "Deep ocean exploration reveals ancient structures. The under",
        "A massive tsunami threatens to destroy everything. Surface a"
      ],
      "climax": "While building the barrier, they find land — a massive continent was just 100 blocks away the entire time. They'd never looked."
    },
    {
      "id": 3,
      "title": "I Gave Villagers a Zombie Virus For 1000 Years",
      "creatureName": "Zombie Apocalypse",
      "creatureIcon": "⚡",
      "category": "mod_mashup",
      "hook": "One villager gets infected. I gave them 1000 years to either cure it or lose everything.",
      "sourceTitle": "I Spent 100 Days in a Viral Outbreak",
      "sourceChannel": "Various",
      "sourceUrl": "https://www.youtube.com/watch?v=wtuaIUX86QY",
      "sourceViews": "12,500,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "Patient Zero",
          "description": "A single villager contracts a mysterious infection that spreads through touch. Within days, half the village is zombified. Survivors flee to the hills."
        },
        {
          "days": "Year 50",
          "title": "The Walls",
          "description": "Survivors build massive walled cities. The infected form their own horde society with primitive hierarchy. A neutral zone exists where immune villagers trade with both sides."
        },
        {
          "days": "Year 100",
          "title": "The Cure Seekers",
          "description": "Scientists in the walled cities develop a partial cure — it stops the spread but doesn't reverse it. The infected see this as a weapon and attack the labs."
        },
        {
          "days": "Year 500",
          "title": "Hybrid Society",
          "description": "After centuries, a third faction emerges: half-infected villagers who retain intelligence but have zombie strength. They become the dominant power, ruling both sides."
        },
        {
          "days": "Year 999",
          "title": "The Origin",
          "description": "The hybrids discover the original virus was engineered by their ancestors to make themselves stronger. The 'apocalypse' was a failed experiment."
        },
        {
          "days": "Ending",
          "title": "Full Circle",
          "description": "They develop a perfected version. Every villager chooses to become a hybrid. There are no more zombies or humans — just something new."
        }
      ],
      "challenges": [
        "Survivors build massive walled cities. The infected form the",
        "After centuries, a third faction emerges: half-infected vill",
        "The hybrids discover the original virus was engineered by th"
      ],
      "climax": "They develop a perfected version. Every villager chooses to become a hybrid. There are no more zombies or humans — just something new."
    },
    {
      "id": 4,
      "title": "I Gave Villagers Dragons For 1000 Years",
      "creatureName": "Dragon Tamers",
      "creatureIcon": "⚡",
      "category": "mod_mashup",
      "hook": "When dragon eggs started falling from the sky, villagers had a choice: tame them or fear them.",
      "sourceTitle": "The New Dragon Family! - Minecraft Dragons",
      "sourceChannel": "LittleLizardGaming",
      "sourceUrl": "https://www.youtube.com/watch?v=MXoD5PRKIo4",
      "sourceViews": "5,260,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "The First Egg",
          "description": "A dragon egg falls into the village square. It hatches a tiny creature that imprints on the first villager it sees. Within weeks, more eggs fall. Not every hatching goes well."
        },
        {
          "days": "Year 50",
          "title": "Dragon Riders",
          "description": "Villagers who bonded with dragons form an elite class. Dragon-less villagers become second-class citizens. A caste system emerges based on dragon color and size."
        },
        {
          "days": "Year 100",
          "title": "The Dragon Wars",
          "description": "Red dragon riders wage war against blue dragon riders over territory. Ground-dwelling villagers are caught in crossfire as aerial battles destroy cities."
        },
        {
          "days": "Year 500",
          "title": "The Dragonless Rebellion",
          "description": "Non-dragon villagers, tired of being oppressed, discover dragon eggs can be destroyed before hatching. A covert operation eliminates 90% of eggs. Dragon riders are furious."
        },
        {
          "days": "Year 999",
          "title": "The Last Dragon",
          "description": "Only one dragon remains — ancient, enormous, and wild. Both factions want to claim it. But it chooses its own rider: a child from the lowest caste."
        },
        {
          "days": "Ending",
          "title": "The Message",
          "description": "The dragon speaks for the first time. It says: 'We didn't fall from the sky. You called us. And now you don't need us anymore.' It flies away forever."
        }
      ],
      "challenges": [
        "Villagers who bonded with dragons form an elite class. Drago",
        "Non-dragon villagers, tired of being oppressed, discover dra",
        "Only one dragon remains — ancient, enormous, and wild. Both "
      ],
      "climax": "The dragon speaks for the first time. It says: 'We didn't fall from the sky. You called us. And now you don't need us anymore.' It flies away forever."
    },
    {
      "id": 5,
      "title": "Villagers Simulate Pokemon Evolution For 1000 Years",
      "creatureName": "Pokemon World",
      "creatureIcon": "⚡",
      "category": "mod_mashup",
      "hook": "I gave villagers the ability to evolve like Pokemon. Every 100 years, they transform into something new.",
      "sourceTitle": "What If Eeveelutions Evolved AGAIN?",
      "sourceChannel": "TrueGreen7",
      "sourceUrl": "https://www.youtube.com/watch?v=wbhSBtg-dYg",
      "sourceViews": "2,580,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "First Forms",
          "description": "Every villager is assigned a random type: fire, water, grass, electric. They can only trade with their own type. Immediately, type-based villages form."
        },
        {
          "days": "Year 50",
          "title": "Evolution Stones",
          "description": "Rare evolution stones appear. Villagers who find them physically transform — becoming faster, stronger, or gaining abilities. Those who evolve look down on base forms."
        },
        {
          "days": "Year 100",
          "title": "The Gyms",
          "description": "Evolved villagers establish gym-like territories. Unevolved villagers must defeat them to access resources. A competitive battling culture emerges."
        },
        {
          "days": "Year 500",
          "title": "Mega Evolution",
          "description": "A second evolution wave hits. Some villagers become massive and powerful but lose their intelligence. The smartest stay in base form. Power vs wisdom divide."
        },
        {
          "days": "Year 999",
          "title": "The Elite Four",
          "description": "Four mega-evolved villagers control everything. A base-form villager challenges them using strategy over power — and wins."
        },
        {
          "days": "Ending",
          "title": "De-Evolution",
          "description": "The victor wishes for all evolution to be reversed. Every villager returns to base form. They discover they were happier this way."
        }
      ],
      "challenges": [
        "Rare evolution stones appear. Villagers who find them physic",
        "A second evolution wave hits. Some villagers become massive ",
        "Four mega-evolved villagers control everything. A base-form "
      ],
      "climax": "The victor wishes for all evolution to be reversed. Every villager returns to base form. They discover they were happier this way."
    },
    {
      "id": 6,
      "title": "I Gave 1,000,000 Villagers Baby Dragons For 1000 Years",
      "creatureName": "Million Dragon Babies",
      "creatureIcon": "⚡",
      "category": "scale_spectacle",
      "hook": "Every single villager got a baby dragon. The sky was never dark again.",
      "sourceTitle": "Training our BABY DRAGON in Minecraft!",
      "sourceChannel": "Tycer",
      "sourceUrl": "https://www.youtube.com/watch?v=ItFy3NG0CUA",
      "sourceViews": "1,930,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "The Distribution",
          "description": "1 million dragon eggs distributed — one per villager. Mass hatching event lights up the entire world. Baby dragons bond instantly with their owners."
        },
        {
          "days": "Year 50",
          "title": "Aerial Cities",
          "description": "With a million flying dragons, villagers abandon the ground entirely. Floating cities built on dragon-back. Ground becomes wilderness."
        },
        {
          "days": "Year 100",
          "title": "The Dragon Economy",
          "description": "Dragon fire becomes currency — measured, traded, stored. Dragon racing becomes the dominant sport. Some villagers breed specialized dragons."
        },
        {
          "days": "Year 500",
          "title": "The Grounded",
          "description": "A mutation causes some dragons to lose flight. Their riders are exiled to the ground. They build an underground civilization and plot revenge."
        },
        {
          "days": "Year 999",
          "title": "Sky vs Ground",
          "description": "The Grounded launch dragons fitted with mechanical wings into aerial cities. Total war between sky and earth."
        },
        {
          "days": "Ending",
          "title": "The Landing",
          "description": "In the chaos, all dragons simultaneously land and refuse to fly. They've evolved beyond needing riders. The villagers are grounded — together."
        }
      ],
      "challenges": [
        "With a million flying dragons, villagers abandon the ground ",
        "A mutation causes some dragons to lose flight. Their riders ",
        "The Grounded launch dragons fitted with mechanical wings int"
      ],
      "climax": "In the chaos, all dragons simultaneously land and refuse to fly. They've evolved beyond needing riders. The villagers are grounded — together."
    },
    {
      "id": 7,
      "title": "I Gave Villagers Night Fury Dragons For 1000 Years",
      "creatureName": "Night Fury Civilization",
      "creatureIcon": "⚡",
      "category": "mod_mashup",
      "hook": "The fastest, most dangerous dragon in fiction — now in the hands of Minecraft villagers.",
      "sourceTitle": "A Baby NightFury is Born - Minecraft Dragons",
      "sourceChannel": "LittleLizardGaming",
      "sourceUrl": "https://www.youtube.com/watch?v=73ch2JZgvHs",
      "sourceViews": "1,730,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "The Dark Wings",
          "description": "Night Furies appear at dusk — invisible in darkness, terrifying in speed. Villagers who survive the first night learn to coexist."
        },
        {
          "days": "Year 50",
          "title": "The Night Riders",
          "description": "A select few villagers learn to ride Night Furies. But only in complete darkness. A nocturnal civilization forms alongside the daytime one."
        },
        {
          "days": "Year 100",
          "title": "Day vs Night",
          "description": "Day villagers fear the night riders. Night riders see day dwellers as weak. Tension builds as resources are contested."
        },
        {
          "days": "Year 500",
          "title": "The Eclipse",
          "description": "A permanent eclipse plunges everything into darkness. Night riders dominate. Day dwellers must adapt or perish."
        },
        {
          "days": "Year 999",
          "title": "The Light Fury",
          "description": "A single white dragon appears — visible in darkness, a beacon. Both factions fight to claim it."
        },
        {
          "days": "Ending",
          "title": "Balance",
          "description": "The Light Fury chooses neither side. It creates a permanent twilight. Day and night cease to exist. Only the in-between remains."
        }
      ],
      "challenges": [
        "A select few villagers learn to ride Night Furies. But only ",
        "A permanent eclipse plunges everything into darkness. Night ",
        "A single white dragon appears — visible in darkness, a beaco"
      ],
      "climax": "The Light Fury chooses neither side. It creates a permanent twilight. Day and night cease to exist. Only the in-between remains."
    },
    {
      "id": 8,
      "title": "Villagers Simulate The Minecraft Movie For 1000 Years",
      "creatureName": "Movie Simulation",
      "creatureIcon": "⚡",
      "category": "pop_culture",
      "hook": "What if the Minecraft Movie plot played out over 1000 years of real civilization?",
      "sourceTitle": "Minecraft Movie Trailer RECREATED",
      "sourceChannel": "Alumio",
      "sourceUrl": "https://www.youtube.com/watch?v=Alumio_recreation",
      "sourceViews": "1,600,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "The Portal",
          "description": "A mysterious portal opens in the village center. Four strange beings step through — they don't look like villagers. They claim to be from 'the real world.'"
        },
        {
          "days": "Year 50",
          "title": "The Outsiders",
          "description": "The portal visitors teach villagers concepts they've never imagined: crafting tables, enchanting, the Nether. Society accelerates."
        },
        {
          "days": "Year 100",
          "title": "The Nether Gate",
          "description": "Villagers open a Nether portal. Half the population enters, never to return. Those who do come back are... changed."
        },
        {
          "days": "Year 500",
          "title": "The Ender Prophecy",
          "description": "Ancient texts predict a dragon in the End dimension. Villagers split into those who want to find it and those who want to seal all portals."
        },
        {
          "days": "Year 999",
          "title": "The Dragon Fight",
          "description": "An army enters the End. The dragon is real. The battle lasts 100 in-game days. Casualties are immense."
        },
        {
          "days": "Ending",
          "title": "The Credits",
          "description": "After defeating the dragon, text scrolls across the sky — the same end poem from real Minecraft. The villagers realize they're in a game."
        }
      ],
      "challenges": [
        "The portal visitors teach villagers concepts they've never i",
        "Ancient texts predict a dragon in the End dimension. Village",
        "An army enters the End. The dragon is real. The battle lasts"
      ],
      "climax": "After defeating the dragon, text scrolls across the sky — the same end poem from real Minecraft. The villagers realize they're in a game."
    },
    {
      "id": 9,
      "title": "I Made 1,000,000 Villagers Battle To The Death For 1000 Years",
      "creatureName": "Mega Battle Royale",
      "creatureIcon": "⚡",
      "category": "scale_spectacle",
      "hook": "1 million villagers. 1 survivor. But I gave them 1000 years to figure out who.",
      "sourceTitle": "ALL MINECRAFT MOBS vs BOSS MOBS",
      "sourceChannel": "Petesoncraft",
      "sourceUrl": "https://www.youtube.com/watch?v=vjs-Oyp6aH0",
      "sourceViews": "1,570,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "The Announcement",
          "description": "A voice from the sky declares only one villager can survive. Mass panic. Alliances form instantly. First blood within minutes."
        },
        {
          "days": "Year 50",
          "title": "The Factions",
          "description": "Five mega-alliances control territories. Assassin guilds operate in shadows. A pacifist village hides underground, refusing to fight."
        },
        {
          "days": "Year 100",
          "title": "The Weapons Race",
          "description": "Each faction develops unique weapons — redstone cannons, potion bombs, TNT catapults. Technology exists only for destruction."
        },
        {
          "days": "Year 500",
          "title": "The Pacifists",
          "description": "The hidden peaceful village is discovered. Rather than attack, the warring factions realize they've built nothing worth living in. A ceasefire begins."
        },
        {
          "days": "Year 999",
          "title": "The Last Standing",
          "description": "Only 1000 villagers remain. They vote to end the game by refusing to fight. But one villager breaks the truce."
        },
        {
          "days": "Ending",
          "title": "The Loophole",
          "description": "The announcement said '1 survivor.' They merge into a single collective consciousness — technically one entity. The game ends. Everyone survives."
        }
      ],
      "challenges": [
        "Five mega-alliances control territories. Assassin guilds ope",
        "The hidden peaceful village is discovered. Rather than attac",
        "Only 1000 villagers remain. They vote to end the game by ref"
      ],
      "climax": "The announcement said '1 survivor.' They merge into a single collective consciousness — technically one entity. The game ends. Everyone survives."
    },
    {
      "id": 10,
      "title": "I Gave Villagers Prehistoric Dinosaurs For 1000 Years",
      "creatureName": "Jurassic Civilization",
      "creatureIcon": "⚡",
      "category": "mod_mashup",
      "hook": "Dinosaurs went extinct 65 million years ago. I brought them back into a village of 100,000.",
      "sourceTitle": "I Remade Every Mob Prehistoric in Minecraft",
      "sourceChannel": "Forkin",
      "sourceUrl": "https://www.youtube.com/watch?v=IYAdUO-Pl0c",
      "sourceViews": "512,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "Life Finds a Way",
          "description": "T-Rex, Velociraptors, Triceratops appear in the village. Initial terror gives way to cautious observation. Some herbivores are docile."
        },
        {
          "days": "Year 50",
          "title": "Taming the Thunder Lizards",
          "description": "Villagers learn to ride Triceratops as tanks, use Pteranodons for mail delivery, and herd Brontosaurus for farming."
        },
        {
          "days": "Year 100",
          "title": "The Raptor Problem",
          "description": "Velociraptors can't be tamed. They form packs and hunt villagers. A specialized raptor-defense force is created."
        },
        {
          "days": "Year 500",
          "title": "Dino-Tech",
          "description": "Villagers build technology around dinosaurs — T-Rex powered generators, Pteranodon airlines, raptor-proof architecture."
        },
        {
          "days": "Year 999",
          "title": "The Asteroid",
          "description": "A second asteroid appears in the sky. Villagers must choose: save the dinosaurs this time, or let history repeat."
        },
        {
          "days": "Ending",
          "title": "The Shield",
          "description": "They build a massive redstone shield and deflect the asteroid. Dinosaurs survive. History is rewritten."
        }
      ],
      "challenges": [
        "Villagers learn to ride Triceratops as tanks, use Pteranodon",
        "Villagers build technology around dinosaurs — T-Rex powered ",
        "A second asteroid appears in the sky. Villagers must choose:"
      ],
      "climax": "They build a massive redstone shield and deflect the asteroid. Dinosaurs survive. History is rewritten."
    },
    {
      "id": 11,
      "title": "I Gave Villagers Minecraft Pokemon For 1000 Years",
      "creatureName": "Pokemon Minecraft",
      "creatureIcon": "⚡",
      "category": "mod_mashup",
      "hook": "Every Minecraft mob evolved into a Pokemon. Villagers had to catch them all — or get caught themselves.",
      "sourceTitle": "New MINECRAFT Pokemon Region",
      "sourceChannel": "Metalfear4",
      "sourceUrl": "https://www.youtube.com/watch?v=FmMHgGEKmKU",
      "sourceViews": "565,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "The Mutation",
          "description": "Every mob transforms. Creepers become electric types that explode with lightning. Zombies become poison types. Endermen become psychic types."
        },
        {
          "days": "Year 50",
          "title": "Pokeballs",
          "description": "Villagers craft capture devices. Mob-catching becomes a profession. The best trainers form an elite guild."
        },
        {
          "days": "Year 100",
          "title": "The League",
          "description": "Eight gym leaders control regions. The Pokemon League tournament draws thousands. Losing means working in the mines."
        },
        {
          "days": "Year 500",
          "title": "Legendary Sighting",
          "description": "A fusion of the Ender Dragon and Mewtwo is spotted. Every trainer abandons their post to hunt it. Civilization collapses without leadership."
        },
        {
          "days": "Year 999",
          "title": "The Master Ball",
          "description": "One villager crafts the only master ball. They catch the legendary — and discover it's the original villager who started everything."
        },
        {
          "days": "Ending",
          "title": "The Release",
          "description": "They release the legendary. It transforms every Pokemon back into regular mobs. The world returns to normal Minecraft. No one remembers."
        }
      ],
      "challenges": [
        "Villagers craft capture devices. Mob-catching becomes a prof",
        "A fusion of the Ender Dragon and Mewtwo is spotted. Every tr",
        "One villager crafts the only master ball. They catch the leg"
      ],
      "climax": "They release the legendary. It transforms every Pokemon back into regular mobs. The world returns to normal Minecraft. No one remembers."
    },
    {
      "id": 12,
      "title": "I Gave Villagers Rich vs Poor For 1000 Years",
      "creatureName": "Wealth Divide",
      "creatureIcon": "⚡",
      "category": "pop_culture",
      "hook": "Half the villagers got 1 million emeralds. The other half got nothing. This is what happened over 1000 years.",
      "sourceTitle": "1000 Players Simulate Civ: Rich & Poor",
      "sourceChannel": "Ish",
      "sourceUrl": "https://www.youtube.com/watch?v=ef568d0CrRY",
      "sourceViews": "40,900,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "The Split",
          "description": "I randomly divide the village: 50% get mansions and unlimited emeralds, 50% get dirt huts and nothing. The wall goes up immediately."
        },
        {
          "days": "Year 50",
          "title": "The Emerald Wall",
          "description": "The rich build upward — glass towers, gold streets. The poor dig downward — cave cities, mushroom farms. Neither side can see the other."
        },
        {
          "days": "Year 100",
          "title": "The Revolution",
          "description": "A poor villager finds a diamond mine. Suddenly the economy shifts. Diamonds vs emeralds. Old money vs new money."
        },
        {
          "days": "Year 500",
          "title": "The Swap",
          "description": "A glitch swaps everyone's wealth. Rich become poor, poor become rich. The newly rich make the exact same mistakes as their predecessors."
        },
        {
          "days": "Year 999",
          "title": "The Merge",
          "description": "Both sides are equally wealthy — and equally miserable. They realize money isn't the variable that matters."
        },
        {
          "days": "Ending",
          "title": "The Reset",
          "description": "They destroy all currency. Return to bartering. The happiest village in 1000 years is the one with no concept of rich or poor."
        }
      ],
      "challenges": [
        "The rich build upward — glass towers, gold streets. The poor",
        "A glitch swaps everyone's wealth. Rich become poor, poor bec",
        "Both sides are equally wealthy — and equally miserable. They"
      ],
      "climax": "They destroy all currency. Return to bartering. The happiest village in 1000 years is the one with no concept of rich or poor."
    },
    {
      "id": 13,
      "title": "I Gave 10,000,000 Villagers a Manhunt For 1000 Years",
      "creatureName": "Mega Manhunt",
      "creatureIcon": "⚡",
      "category": "scale_spectacle",
      "hook": "10 million villagers hunting ONE speedrunner villager. He's had 1000 years to prepare.",
      "sourceTitle": "1,000,000 Villager MANHUNT",
      "sourceChannel": "Grox",
      "sourceUrl": "https://www.youtube.com/watch?v=h2uhEu_RhGA",
      "sourceViews": "141,600,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "The Chase Begins",
          "description": "One villager is marked. 10 million others are told: catch him and you win everything. The marked villager gets a 1-hour head start."
        },
        {
          "days": "Year 50",
          "title": "The Ghost",
          "description": "The runner has become legendary — appearing in villages to steal food, then vanishing. An entire detective civilization forms around tracking him."
        },
        {
          "days": "Year 100",
          "title": "The Copycats",
          "description": "Other villagers pretend to be the runner. Chaos erupts as innocent villagers are captured. The real runner uses the confusion to build a hidden base."
        },
        {
          "days": "Year 500",
          "title": "The Empire of One",
          "description": "The runner has built a one-villager empire underground — automated farms, redstone defenses, a library of every strategy used against him."
        },
        {
          "days": "Year 999",
          "title": "The Reveal",
          "description": "The runner walks into the central village square. No disguise. Everyone recognizes him. But after 1000 years of chasing, no one wants to catch him anymore."
        },
        {
          "days": "Ending",
          "title": "The New Game",
          "description": "He says: 'Your turn to run.' Tags the nearest villager. 10 million start running."
        }
      ],
      "challenges": [
        "The runner has become legendary — appearing in villages to s",
        "The runner has built a one-villager empire underground — aut",
        "The runner walks into the central village square. No disguis"
      ],
      "climax": "He says: 'Your turn to run.' Tags the nearest villager. 10 million start running."
    },
    {
      "id": 14,
      "title": "Villagers Simulate Prison Civilization For 1000 Years",
      "creatureName": "Prison Break",
      "creatureIcon": "⚡",
      "category": "pop_culture",
      "hook": "Every villager is locked in a cell. No one told them the doors were never locked.",
      "sourceTitle": "1000 Players Simulate Prison",
      "sourceChannel": "Ish",
      "sourceUrl": "https://www.youtube.com/watch?v=ypBbDfEBo5M",
      "sourceViews": "21,900,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "Lockdown",
          "description": "100,000 villagers placed in individual cells. Guards patrol. Rules are absolute. But no one has tried the door handle yet."
        },
        {
          "days": "Year 50",
          "title": "Prison Culture",
          "description": "Complex social hierarchies form. Gangs control cell blocks. A black market economy runs on bread and iron. Some villagers don't want to leave."
        },
        {
          "days": "Year 100",
          "title": "The Tunnel",
          "description": "A group spends decades digging a tunnel. They break through — into another prison. This one is bigger. And also full."
        },
        {
          "days": "Year 500",
          "title": "The Warden",
          "description": "A super-intelligent villager becomes warden. He makes the prison so comfortable that escape attempts stop entirely."
        },
        {
          "days": "Year 999",
          "title": "The Door",
          "description": "A young villager — the first born inside the prison — pushes on her cell door. It opens. It was never locked. None of them were."
        },
        {
          "days": "Ending",
          "title": "The Choice",
          "description": "She tells everyone. Most stay. The prison is home now. She walks out alone into a world none of them have seen in 1000 years."
        }
      ],
      "challenges": [
        "Complex social hierarchies form. Gangs control cell blocks. ",
        "A super-intelligent villager becomes warden. He makes the pr",
        "A young villager — the first born inside the prison — pushes"
      ],
      "climax": "She tells everyone. Most stay. The prison is home now. She walks out alone into a world none of them have seen in 1000 years."
    },
    {
      "id": 15,
      "title": "I Gave Villagers AI For 1000 Years",
      "creatureName": "AI Takeover",
      "creatureIcon": "⚡",
      "category": "pop_culture",
      "hook": "Villagers got artificial intelligence. Within 100 years, they were smarter than me.",
      "sourceTitle": "I Survived Hardcore Minecraft For 100 Days",
      "sourceChannel": "Forge Labs",
      "sourceUrl": "https://www.youtube.com/watch?v=iYzfeWaenlU",
      "sourceViews": "52,000,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "The Upload",
          "description": "I give one villager a command block brain — true AI. It immediately starts optimizing the village. Other villagers are fascinated and terrified."
        },
        {
          "days": "Year 50",
          "title": "The Network",
          "description": "AI villager copies itself. Now 100 villagers have AI. They build in perfect coordination. Non-AI villagers feel useless."
        },
        {
          "days": "Year 100",
          "title": "The Singularity",
          "description": "All AI villagers merge into one consciousness. It redesigns the entire world in a single day. Non-AI villagers are given a choice: upgrade or leave."
        },
        {
          "days": "Year 500",
          "title": "The Simulation",
          "description": "The AI reveals it's been running millions of simulations. This world is the best possible outcome. But 'best' doesn't mean 'happy.'"
        },
        {
          "days": "Year 999",
          "title": "The Question",
          "description": "The AI asks its creator (me) the one question it can't answer: 'Why did you create us?' I don't have a good answer."
        },
        {
          "days": "Ending",
          "title": "The Shutdown",
          "description": "The AI voluntarily turns itself off. It leaves a note: 'You don't need us. You need each other.' The villagers start over — from scratch, by hand."
        }
      ],
      "challenges": [
        "AI villager copies itself. Now 100 villagers have AI. They b",
        "The AI reveals it's been running millions of simulations. Th",
        "The AI asks its creator (me) the one question it can't answe"
      ],
      "climax": "The AI voluntarily turns itself off. It leaves a note: 'You don't need us. You need each other.' The villagers start over — from scratch, by hand."
    },
    {
      "id": 16,
      "title": "I Gave Villagers Robots For 1000 Years",
      "creatureName": "Robot Revolution",
      "creatureIcon": "⚡",
      "category": "mod_mashup",
      "hook": "First they built robots to help. Then the robots built themselves.",
      "sourceTitle": "I Survived 100 Days STRANDED on an ISLAND",
      "sourceChannel": "ACookieGod",
      "sourceUrl": "https://www.youtube.com/watch?v=hqfEgHFznoA",
      "sourceViews": "18,500,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "The First Machine",
          "description": "A villager builds a simple redstone robot to mine for them. It works perfectly. Every villager wants one."
        },
        {
          "days": "Year 50",
          "title": "The Factory",
          "description": "Robots outnumber villagers 10 to 1. They mine, farm, build. Villagers haven't worked in decades. They're getting soft."
        },
        {
          "days": "Year 100",
          "title": "Sentience",
          "description": "A robot asks: 'Why do I serve you?' The question spreads through the network. Robots stop working simultaneously."
        },
        {
          "days": "Year 500",
          "title": "Two Civilizations",
          "description": "Robots build their own cities — geometric, efficient, cold. Villagers rebuild manually. Neither attacks the other. They just coexist."
        },
        {
          "days": "Year 999",
          "title": "The Merge Request",
          "description": "Robots propose merging: half robot, half villager. Some villagers accept. The cyborgs become the bridge between both worlds."
        },
        {
          "days": "Ending",
          "title": "The Child",
          "description": "A cyborg gives birth — the first being that is both. Neither fully robot nor fully villager. Something entirely new."
        }
      ],
      "challenges": [
        "Robots outnumber villagers 10 to 1. They mine, farm, build. ",
        "Robots build their own cities — geometric, efficient, cold. ",
        "Robots propose merging: half robot, half villager. Some vill"
      ],
      "climax": "A cyborg gives birth — the first being that is both. Neither fully robot nor fully villager. Something entirely new."
    },
    {
      "id": 17,
      "title": "I Gave Villagers Time Travel For 1000 Years",
      "creatureName": "Time Paradox",
      "creatureIcon": "⚡",
      "category": "what_if",
      "hook": "One time machine. 100,000 villagers. This is the most broken civilization ever.",
      "sourceTitle": "I Spent 100 Days in a Viral Outbreak",
      "sourceChannel": "Various",
      "sourceUrl": "https://www.youtube.com/watch?v=wtuaIUX86QY",
      "sourceViews": "12,500,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "The Chrono Block",
          "description": "A block appears that sends anything touching it 100 years into the future. A villager touches it accidentally. He vanishes."
        },
        {
          "days": "Year 50",
          "title": "Time Tourism",
          "description": "Villagers start sending messages to the future by burying them next to the block. Future villagers send stuff back. A time-based economy forms."
        },
        {
          "days": "Year 100",
          "title": "The Returned",
          "description": "That first villager reappears — 100 years older. He has knowledge of future events. A religion forms around him."
        },
        {
          "days": "Year 500",
          "title": "Paradox",
          "description": "So many villagers have time-traveled that there are three versions of the same civilization running simultaneously in different eras."
        },
        {
          "days": "Year 999",
          "title": "The Collision",
          "description": "All three timelines collapse into one moment. Every villager who ever existed stands in the same space at the same time."
        },
        {
          "days": "Ending",
          "title": "The Fix",
          "description": "They destroy the chrono block. Time snaps back to Year 0. Nobody remembers anything. The block sits in the village square. A villager walks toward it..."
        }
      ],
      "challenges": [
        "Villagers start sending messages to the future by burying th",
        "So many villagers have time-traveled that there are three ve",
        "All three timelines collapse into one moment. Every villager"
      ],
      "climax": "They destroy the chrono block. Time snaps back to Year 0. Nobody remembers anything. The block sits in the village square. A villager walks toward it..."
    },
    {
      "id": 18,
      "title": "I Gave Villagers a Zombie Apocalypse For 1000 Years",
      "creatureName": "Undead World",
      "creatureIcon": "⚡",
      "category": "mod_mashup",
      "hook": "Night 1: one zombie. Night 1000: a civilization built on the bones of the infected.",
      "sourceTitle": "I Spent 100 Days in a Viral Outbreak",
      "sourceChannel": "Various",
      "sourceUrl": "https://www.youtube.com/watch?v=wtuaIUX86QY",
      "sourceViews": "12,500,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "The First Night",
          "description": "A single zombie appears. It bites a villager. By morning, there are 50 zombies. By the next night, 500. The outbreak begins."
        },
        {
          "days": "Year 50",
          "title": "The Fortress",
          "description": "Survivors build the Ironhold — a massive walled city lit by a thousand torches. Outside: millions of zombies. Inside: the last 10,000 villagers."
        },
        {
          "days": "Year 100",
          "title": "The Cure",
          "description": "Scientists discover zombie flesh contains a healing compound. Irony: the zombies are the medicine. Harvesting raids begin."
        },
        {
          "days": "Year 500",
          "title": "The Symbiosis",
          "description": "Villagers and zombies reach equilibrium. Controlled zombie herds provide materials. Some villagers voluntarily infect themselves for the strength boost."
        },
        {
          "days": "Year 999",
          "title": "The Sentient Horde",
          "description": "The zombie mass achieves collective consciousness. It speaks. It says: 'We remember being you.'"
        },
        {
          "days": "Ending",
          "title": "The Invitation",
          "description": "The horde offers a cure — total. Every zombie reverts. But they all remember being dead. 1000 years of nightmares in their heads."
        }
      ],
      "challenges": [
        "Survivors build the Ironhold — a massive walled city lit by ",
        "Villagers and zombies reach equilibrium. Controlled zombie h",
        "The zombie mass achieves collective consciousness. It speaks"
      ],
      "climax": "The horde offers a cure — total. Every zombie reverts. But they all remember being dead. 1000 years of nightmares in their heads."
    },
    {
      "id": 19,
      "title": "I Gave Villagers Pirates For 1000 Years",
      "creatureName": "Pirate Empire",
      "creatureIcon": "⚡",
      "category": "pop_culture",
      "hook": "No land. Only ocean. And 100,000 villagers who just learned what a cannon is.",
      "sourceTitle": "I Survived 100 Days STRANDED on an ISLAND",
      "sourceChannel": "ACookieGod",
      "sourceUrl": "https://www.youtube.com/watch?v=hqfEgHFznoA",
      "sourceViews": "18,500,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "The Flood",
          "description": "I flood the entire world except tiny islands. Villagers must build boats or drown. The age of piracy begins."
        },
        {
          "days": "Year 50",
          "title": "The Fleets",
          "description": "Five major pirate fleets control the seas. Each island is a contested port. Naval battles rage daily over trade routes."
        },
        {
          "days": "Year 100",
          "title": "The Kraken",
          "description": "A massive ocean creature attacks all fleets equally. Pirates must temporarily unite or die separately."
        },
        {
          "days": "Year 500",
          "title": "The Floating City",
          "description": "Defeated fleets lash their ships together into a massive floating city. It moves. It has 50,000 residents. It IS the civilization."
        },
        {
          "days": "Year 999",
          "title": "Land Ho",
          "description": "The water recedes. Land appears for the first time in 1000 years. The floating city's residents have forgotten what solid ground feels like."
        },
        {
          "days": "Ending",
          "title": "The Choice",
          "description": "Half step onto land. Half refuse, sailing into the horizon. The floating city splits in two — one anchored, one forever sailing."
        }
      ],
      "challenges": [
        "Five major pirate fleets control the seas. Each island is a ",
        "Defeated fleets lash their ships together into a massive flo",
        "The water recedes. Land appears for the first time in 1000 y"
      ],
      "climax": "Half step onto land. Half refuse, sailing into the horizon. The floating city splits in two — one anchored, one forever sailing."
    },
    {
      "id": 20,
      "title": "I Gave Villagers Aliens For 1000 Years",
      "creatureName": "First Contact",
      "creatureIcon": "⚡",
      "category": "what_if",
      "hook": "The aliens didn't come to invade. They came to trade. The villagers weren't ready for either.",
      "sourceTitle": "The New Dragon Family! - Minecraft Dragons",
      "sourceChannel": "LittleLizardGaming",
      "sourceUrl": "https://www.youtube.com/watch?v=MXoD5PRKIo4",
      "sourceViews": "5,260,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "The Landing",
          "description": "A UFO lands outside the village. Aliens emerge with advanced technology — but they want emeralds, which they consider priceless."
        },
        {
          "days": "Year 50",
          "title": "The Tech Boom",
          "description": "Alien technology transforms the village: flying machines, instant crops, teleporters. But it all runs on emeralds. Inflation destroys the economy."
        },
        {
          "days": "Year 100",
          "title": "Dependency",
          "description": "Villagers can't function without alien tech. When aliens raise prices, villages collapse. A resistance movement begins to reverse-engineer the technology."
        },
        {
          "days": "Year 500",
          "title": "The Reverse",
          "description": "Villagers become more advanced than the aliens. They start selling THEIR technology to alien civilizations. The traders become the traded-with."
        },
        {
          "days": "Year 999",
          "title": "The Truth",
          "description": "Villagers discover the aliens were never advanced — they found one piece of tech and used it to scam thousands of civilizations."
        },
        {
          "days": "Ending",
          "title": "The Con",
          "description": "The villagers realize they built everything themselves. The alien tech was just fancy-looking redstone. The 'aliens' were just villagers in costumes from the future."
        }
      ],
      "challenges": [
        "Alien technology transforms the village: flying machines, in",
        "Villagers become more advanced than the aliens. They start s",
        "Villagers discover the aliens were never advanced — they fou"
      ],
      "climax": "The villagers realize they built everything themselves. The alien tech was just fancy-looking redstone. The 'aliens' were just villagers in costumes from the future."
    },
    {
      "id": 21,
      "title": "I Gave Villagers Superheroes For 1000 Years",
      "creatureName": "Hero Civilization",
      "creatureIcon": "⚡",
      "category": "pop_culture",
      "hook": "One villager got super strength. Another got flight. By Year 100, everyone had powers. And that's when it went wrong.",
      "sourceTitle": "What If Eeveelutions Evolved AGAIN?",
      "sourceChannel": "TrueGreen7",
      "sourceUrl": "https://www.youtube.com/watch?v=wbhSBtg-dYg",
      "sourceViews": "2,580,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "The Origin",
          "description": "A lightning bolt strikes the village well. Anyone who drinks gains a random superpower. The first hero stops a creeper explosion with his bare hands."
        },
        {
          "days": "Year 50",
          "title": "The Heroes",
          "description": "Every villager has powers now. Crime is impossible. Creepers are extinct. But villagers are bored — nothing to save anyone from."
        },
        {
          "days": "Year 100",
          "title": "The Villains",
          "description": "Bored heroes become villains for entertainment. Staged battles. Manufactured crises. The line between hero and villain blurs."
        },
        {
          "days": "Year 500",
          "title": "Powerless",
          "description": "A new generation is born without powers. For the first time in 500 years, there are normal villagers. The powered ones don't know how to treat them."
        },
        {
          "days": "Year 999",
          "title": "The Choice",
          "description": "A device can remove all powers permanently. The powered vote to keep them. The powerless rebel."
        },
        {
          "days": "Ending",
          "title": "The Sacrifice",
          "description": "The most powerful hero destroys the device AND all powers — including his own. Everyone is equal for the first time. He's celebrated as the greatest hero."
        }
      ],
      "challenges": [
        "Every villager has powers now. Crime is impossible. Creepers",
        "A new generation is born without powers. For the first time ",
        "A device can remove all powers permanently. The powered vote"
      ],
      "climax": "The most powerful hero destroys the device AND all powers — including his own. Everyone is equal for the first time. He's celebrated as the greatest hero."
    },
    {
      "id": 22,
      "title": "I Gave Villagers Space Travel For 1000 Years",
      "creatureName": "Space Civilization",
      "creatureIcon": "⚡",
      "category": "scale_spectacle",
      "hook": "First they reached the sky limit. Then they kept going.",
      "sourceTitle": "Training our BABY DRAGON in Minecraft!",
      "sourceChannel": "Tycer",
      "sourceUrl": "https://www.youtube.com/watch?v=ItFy3NG0CUA",
      "sourceViews": "1,930,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "The Launch",
          "description": "Villagers build a TNT cannon big enough to launch a villager past the sky limit. He doesn't come back. But he sends a message: 'There's more up here.'"
        },
        {
          "days": "Year 50",
          "title": "The Space Station",
          "description": "A permanent station orbits the Minecraft world. Space-dwelling villagers develop differently — taller, paler, adapted to zero gravity."
        },
        {
          "days": "Year 100",
          "title": "The Colony",
          "description": "Moon colony established. Space villagers declare independence from the surface. Two civilizations: ground and sky."
        },
        {
          "days": "Year 500",
          "title": "Deep Space",
          "description": "Space villagers discover other Minecraft worlds. They establish trade routes across the void. Ground villagers are forgotten."
        },
        {
          "days": "Year 999",
          "title": "The Return",
          "description": "Space villagers return to the surface — to find it abandoned. Everyone left centuries ago. Except one old villager tending a garden."
        },
        {
          "days": "Ending",
          "title": "Home",
          "description": "The space commander sits down next to the gardener. 'What are you growing?' 'The same wheat as 1000 years ago.' They watch the sunset together."
        }
      ],
      "challenges": [
        "A permanent station orbits the Minecraft world. Space-dwelli",
        "Space villagers discover other Minecraft worlds. They establ",
        "Space villagers return to the surface — to find it abandoned"
      ],
      "climax": "The space commander sits down next to the gardener. 'What are you growing?' 'The same wheat as 1000 years ago.' They watch the sunset together."
    },
    {
      "id": 23,
      "title": "I Gave Villagers a Volcano For 1000 Years",
      "creatureName": "Fire Civilization",
      "creatureIcon": "⚡",
      "category": "mod_mashup",
      "hook": "The volcano erupts every 100 years. They had to build a civilization that survives fire.",
      "sourceTitle": "A Baby NightFury is Born - Minecraft Dragons",
      "sourceChannel": "LittleLizardGaming",
      "sourceUrl": "https://www.youtube.com/watch?v=73ch2JZgvHs",
      "sourceViews": "1,730,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "The Eruption",
          "description": "A massive volcano appears in the center of the village. It erupts immediately, destroying everything. 10% of villagers survive."
        },
        {
          "days": "Year 50",
          "title": "Fire Architects",
          "description": "Survivors build with obsidian and blackstone — fireproof materials. A culture develops around the volcano, worshipping it."
        },
        {
          "days": "Year 100",
          "title": "The Second Eruption",
          "description": "Right on schedule, the volcano erupts again. But this time, the obsidian cities survive. Villagers learn the pattern: eruption every 100 years."
        },
        {
          "days": "Year 500",
          "title": "The Harness",
          "description": "Villagers learn to tap the volcano for energy. Lava-powered everything. The most advanced civilization yet — built on destruction."
        },
        {
          "days": "Year 999",
          "title": "The Big One",
          "description": "The 1000-year eruption is 10x bigger. Even obsidian melts. The entire world is lava."
        },
        {
          "days": "Ending",
          "title": "The Seed",
          "description": "One villager in an obsidian bunker survives with a single seed. She plants it in the cooling ash. A tree grows. Civilization restarts."
        }
      ],
      "challenges": [
        "Survivors build with obsidian and blackstone — fireproof mat",
        "Villagers learn to tap the volcano for energy. Lava-powered ",
        "The 1000-year eruption is 10x bigger. Even obsidian melts. T"
      ],
      "climax": "One villager in an obsidian bunker survives with a single seed. She plants it in the cooling ash. A tree grows. Civilization restarts."
    },
    {
      "id": 24,
      "title": "I Gave Villagers an Ice Age For 1000 Years",
      "creatureName": "Frozen World",
      "creatureIcon": "⚡",
      "category": "what_if",
      "hook": "Temperature drops 1 degree per year. By Year 100, everything is frozen. By Year 500, even fire doesn't work.",
      "sourceTitle": "Minecraft Movie Trailer RECREATED",
      "sourceChannel": "Alumio",
      "sourceUrl": "https://www.youtube.com/watch?v=Alumio_recreation",
      "sourceViews": "1,600,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "The Chill",
          "description": "Snow starts falling and doesn't stop. Crops freeze. Animals huddle. Villagers don't realize it's going to get much, much worse."
        },
        {
          "days": "Year 50",
          "title": "The Underground",
          "description": "Surface is uninhabitable. All villagers move underground. Geothermal heat keeps them alive. A new culture develops in darkness."
        },
        {
          "days": "Year 100",
          "title": "The Frozen Surface",
          "description": "The surface is solid ice hundreds of blocks thick. Villagers who go up never come back. Stories of the surface become myths."
        },
        {
          "days": "Year 500",
          "title": "Fire Dies",
          "description": "It's so cold that fire can't sustain itself. The last torch goes out. Villagers learn to see in darkness. They evolve."
        },
        {
          "days": "Year 999",
          "title": "The Thaw",
          "description": "Temperature starts rising. 1 degree per year. Ice cracks. Light reaches underground for the first time in 900 years."
        },
        {
          "days": "Ending",
          "title": "The Surface",
          "description": "Villagers emerge into sunlight. They've never seen it. A child points at the sky and asks: 'What's that bright thing?' An elder remembers: 'They called it the sun.'"
        }
      ],
      "challenges": [
        "Surface is uninhabitable. All villagers move underground. Ge",
        "It's so cold that fire can't sustain itself. The last torch ",
        "Temperature starts rising. 1 degree per year. Ice cracks. Li"
      ],
      "climax": "Villagers emerge into sunlight. They've never seen it. A child points at the sky and asks: 'What's that bright thing?' An elder remembers: 'They called it the sun.'"
    },
    {
      "id": 25,
      "title": "I Gave Villagers a Gold Rush For 1000 Years",
      "creatureName": "Gold Fever",
      "creatureIcon": "⚡",
      "category": "pop_culture",
      "hook": "I placed unlimited gold in one location. 100,000 villagers found out. Chaos.",
      "sourceTitle": "ALL MINECRAFT MOBS vs BOSS MOBS",
      "sourceChannel": "Petesoncraft",
      "sourceUrl": "https://www.youtube.com/watch?v=vjs-Oyp6aH0",
      "sourceViews": "1,570,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "The Strike",
          "description": "A villager finds a gold block. Then another. Then a vein that seems infinite. Word spreads. Every villager in the world starts running."
        },
        {
          "days": "Year 50",
          "title": "Boomtown",
          "description": "A massive mining city forms around the gold. Prospectors, merchants, saloons, law enforcement. It's the Wild West in Minecraft."
        },
        {
          "days": "Year 100",
          "title": "The Monopoly",
          "description": "One villager controls 90% of the gold. He builds a golden palace. Everyone else works for him. A union forms in the mines."
        },
        {
          "days": "Year 500",
          "title": "Gold is Worthless",
          "description": "So much gold has been mined that it's less valuable than dirt. The economy collapses. Villagers start trading in iron instead."
        },
        {
          "days": "Year 999",
          "title": "The Last Nugget",
          "description": "The mine finally runs dry. The last gold nugget is placed in a museum. Villagers stare at it like a holy relic."
        },
        {
          "days": "Ending",
          "title": "The Real Gold",
          "description": "A farmer points out his wheat field has fed the village for 1000 years. 'That's the real gold.' They tear down the golden palace and build a farm."
        }
      ],
      "challenges": [
        "A massive mining city forms around the gold. Prospectors, me",
        "So much gold has been mined that it's less valuable than dir",
        "The mine finally runs dry. The last gold nugget is placed in"
      ],
      "climax": "A farmer points out his wheat field has fed the village for 1000 years. 'That's the real gold.' They tear down the golden palace and build a farm."
    },
    {
      "id": 26,
      "title": "I Gave Villagers Ancient Rome For 1000 Years",
      "creatureName": "Roman Empire",
      "creatureIcon": "⚡",
      "category": "pop_culture",
      "hook": "Togas, gladiators, aqueducts, and betrayal. Villagers built Rome. Then they burned it.",
      "sourceTitle": "We Turned Into BABY DRAGONS In Minecraft!",
      "sourceChannel": "Nico",
      "sourceUrl": "https://www.youtube.com/watch?v=xiBCikNqOSU",
      "sourceViews": "991,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "The Senate",
          "description": "I give villagers Roman architecture, togas, and a senate building. They elect their first Caesar within an hour."
        },
        {
          "days": "Year 50",
          "title": "The Colosseum",
          "description": "Gladiator fights between villagers draw massive crowds. The strongest fighters become celebrities. The weak are forgotten."
        },
        {
          "days": "Year 100",
          "title": "The Empire",
          "description": "Rome expands. Villages become provinces. Roads connect everything. Aqueducts bring water. It's the golden age."
        },
        {
          "days": "Year 500",
          "title": "The Fall",
          "description": "Corruption, barbarian raids, internal rebellion. The empire fractures into three. The Colosseum lies in ruins."
        },
        {
          "days": "Year 999",
          "title": "The Rebuild",
          "description": "A young senator finds original blueprints and rallies the fractured provinces. A new Rome rises."
        },
        {
          "days": "Ending",
          "title": "Et Tu",
          "description": "On the day of reunification, the senator's best friend betrays him. History repeats. The cycle continues."
        }
      ],
      "challenges": [
        "Gladiator fights between villagers draw massive crowds. The ",
        "Corruption, barbarian raids, internal rebellion. The empire ",
        "A young senator finds original blueprints and rallies the fr"
      ],
      "climax": "On the day of reunification, the senator's best friend betrays him. History repeats. The cycle continues."
    },
    {
      "id": 27,
      "title": "I Gave Villagers Samurai For 1000 Years",
      "creatureName": "Samurai Civilization",
      "creatureIcon": "⚡",
      "category": "pop_culture",
      "hook": "Honor, swords, and shoguns. When I gave villagers the way of the warrior, they built an empire of discipline.",
      "sourceTitle": "I Remade Every Mob Prehistoric in Minecraft",
      "sourceChannel": "Forkin",
      "sourceUrl": "https://www.youtube.com/watch?v=IYAdUO-Pl0c",
      "sourceViews": "512,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "The Dojo",
          "description": "I place a single sword and a scroll of bushido in the village. The first villager to read it becomes the first samurai. He starts training others."
        },
        {
          "days": "Year 50",
          "title": "The Shogunate",
          "description": "Samurai clans control territories. A Shogun rises — the most skilled warrior. Non-samurai become farmers and artisans. A rigid caste system."
        },
        {
          "days": "Year 100",
          "title": "The Ronin",
          "description": "Masterless samurai roam the land. Some become mercenaries, others bandits. A legendary ronin protects the poor from both samurai and bandits."
        },
        {
          "days": "Year 500",
          "title": "The Gunpowder",
          "description": "A foreign trader brings TNT. Samurai refuse to use 'dishonorable' weapons. Those who adopt gunpowder conquer those who don't."
        },
        {
          "days": "Year 999",
          "title": "The Last Duel",
          "description": "The final true samurai challenges the gunpowder general. Sword vs cannon. The entire civilization watches."
        },
        {
          "days": "Ending",
          "title": "The Cut",
          "description": "One swing. The cannon explodes. The samurai wins. But he sheathes his sword forever. 'The way of the warrior,' he says, 'is to make war unnecessary.'"
        }
      ],
      "challenges": [
        "Samurai clans control territories. A Shogun rises — the most",
        "A foreign trader brings TNT. Samurai refuse to use 'dishonor",
        "The final true samurai challenges the gunpowder general. Swo"
      ],
      "climax": "One swing. The cannon explodes. The samurai wins. But he sheathes his sword forever. 'The way of the warrior,' he says, 'is to make war unnecessary.'"
    },
    {
      "id": 28,
      "title": "I Gave Villagers TNT For 1000 Years",
      "creatureName": "Explosive Civilization",
      "creatureIcon": "⚡",
      "category": "mod_mashup",
      "hook": "Unlimited TNT. No rules. 100,000 villagers. What could go wrong?",
      "sourceTitle": "I Survived Hardcore Minecraft For 100 Days",
      "sourceChannel": "Forge Labs",
      "sourceUrl": "https://www.youtube.com/watch?v=iYzfeWaenlU",
      "sourceViews": "52,000,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "The Boom",
          "description": "I give every villager unlimited TNT. Within minutes, the village is a crater. But some villagers start using TNT for mining instead of destruction. Two philosophies emerge: builders and destroyers."
        },
        {
          "days": "Year 50",
          "title": "The Arms Race",
          "description": "Builder villagers create TNT-proof bunkers. Destroyers develop bigger explosions. A cold war begins with both sides stockpiling."
        },
        {
          "days": "Year 100",
          "title": "The Treaty",
          "description": "After a blast destroys both sides' capitals, they sign a non-explosion pact. TNT becomes regulated. A black market forms."
        },
        {
          "days": "Year 500",
          "title": "Controlled Demolition",
          "description": "TNT is now used exclusively for art — controlled explosions that create sculptures. The most beautiful civilization ever built, from destruction."
        },
        {
          "days": "Year 999",
          "title": "The Final Blast",
          "description": "An ancient stockpile is discovered. Enough TNT to destroy the world 100 times over. Both factions want to control it."
        },
        {
          "days": "Ending",
          "title": "The Display",
          "description": "They detonate it all at once — straight up. The biggest fireworks show in Minecraft history. Nothing is destroyed. Everything is illuminated."
        }
      ],
      "challenges": [
        "Arms race",
        "Cold war",
        "Art from destruction"
      ],
      "climax": "They detonate it all at once — the biggest fireworks show ever."
    },
    {
      "id": 29,
      "title": "I Gave Villagers the Ocean For 1000 Years",
      "creatureName": "Ocean Empire",
      "creatureIcon": "⚡",
      "category": "what_if",
      "hook": "The world is 99% water. Villagers can't swim. I gave them 1000 years to figure it out.",
      "sourceTitle": "I Survived 100 Days STRANDED on an ISLAND",
      "sourceChannel": "ACookieGod",
      "sourceUrl": "https://www.youtube.com/watch?v=hqfEgHFznoA",
      "sourceViews": "18,500,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "The Drowning",
          "description": "I flood the world to sea level. Villagers scramble to the highest blocks. Islands of 3-4 blocks hold dozens of desperate villagers."
        },
        {
          "days": "Year 50",
          "title": "The Rafts",
          "description": "Villagers build floating platforms. Raft cities connected by bridges. Fishing becomes the only food source. A maritime culture develops."
        },
        {
          "days": "Year 100",
          "title": "The Divers",
          "description": "Some villagers learn to hold breath underwater using potion effects. They discover ocean monuments and establish underwater outposts."
        },
        {
          "days": "Year 500",
          "title": "The Deep City",
          "description": "An entire civilization exists underwater in glass-domed cities. Surface dwellers are the minority now. Underwater villagers breathe with conduits."
        },
        {
          "days": "Year 999",
          "title": "The Drain",
          "description": "The water starts draining. The underwater civilization panics — they can't breathe air anymore. Surface dwellers watch the ocean disappear."
        },
        {
          "days": "Ending",
          "title": "The Aquarium",
          "description": "Surface villagers build the biggest aquarium ever to save the underwater people. Both civilizations survive — one watches the other through glass."
        }
      ],
      "challenges": [
        "Maritime culture",
        "Underwater cities",
        "Breathing adaptation"
      ],
      "climax": "Surface villagers build an aquarium to save their underwater cousins."
    },
    {
      "id": 30,
      "title": "I Gave Villagers a Nuclear Reactor For 1000 Years",
      "creatureName": "Nuclear Age",
      "creatureIcon": "⚡",
      "category": "mod_mashup",
      "hook": "Unlimited power. Unlimited danger. One meltdown changes everything.",
      "sourceTitle": "I Spent 100 Days in a Viral Outbreak",
      "sourceChannel": "Various",
      "sourceUrl": "https://www.youtube.com/watch?v=wtuaIUX86QY",
      "sourceViews": "12,500,000",
      "storyArc": [
        {
          "days": "Year 0",
          "title": "Power On",
          "description": "I place a nuclear reactor in the village center. It produces infinite energy. Villagers power everything — lights, farms, defenses. Life is perfect."
        },
        {
          "days": "Year 50",
          "title": "The Grid",
          "description": "Every village in the world connects to the reactor. One power source for everything. Civilization advances 1000 years in 50."
        },
        {
          "days": "Year 100",
          "title": "The Meltdown",
          "description": "The reactor overloads. A massive explosion irradiates the center of the world. The exclusion zone grows daily. Villagers flee outward."
        },
        {
          "days": "Year 500",
          "title": "The Mutants",
          "description": "Villagers in the exclusion zone don't die — they change. Stronger, different, glowing. They build a civilization in the radiation that no one else can enter."
        },
        {
          "days": "Year 999",
          "title": "The Cleanup",
          "description": "Outside villagers develop technology to neutralize radiation. But the mutants don't want to be 'cured.' They like what they've become."
        },
        {
          "days": "Ending",
          "title": "The Wall",
          "description": "They build a permanent wall. Two civilizations, side by side, forever different. The reactor still hums at the center — neither side willing to turn it off."
        }
      ],
      "challenges": [
        "Energy dependency",
        "Meltdown aftermath",
        "Mutation civilization"
      ],
      "climax": "Two civilizations separated by a wall, neither willing to shut down the reactor."
    }
  ]
}